{
  "bos_token_id": 1,
  "elementwise_affine": true,
  "eos_token_id": 2,
  "fuse_cross_entropy": false,
  "fuse_norm": false,
  "fuse_swiglu": false,
  "hidden_act": "swish",
  "hidden_ratio": 4,
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": null,
  "max_position_embeddings": 8192,
  "model_type": "transformer",
  "norm_eps": 1e-06,
  "num_heads": 16,
  "num_hidden_layers": 24,
  "num_kv_heads": null,
  "qk_norm": false,
  "qkv_bias": false,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "transformers_version": "4.51.3",
  "use_cache": true,
  "use_l2warp": false,
  "vocab_size": 32000,
  "window_size": null
}
