{
  "attn": null,
  "attn_mode": "chunk",
  "bos_token_id": 1,
  "conv_size": 4,
  "elementwise_affine": true,
  "eos_token_id": 2,
  "expand_ratio": 128,
  "fuse_cross_entropy": false,
  "fuse_norm": false,
  "fuse_swiglu": false,
  "hidden_act": "swish",
  "hidden_ratio": 4,
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": null,
  "max_position_embeddings": 8192,
  "model_type": "hgrn2",
  "norm_eps": 1e-06,
  "num_heads": 16,
  "num_hidden_layers": 24,
  "tie_word_embeddings": false,
  "transformers_version": "4.51.3",
  "use_cache": true,
  "use_l2warp": false,
  "use_lower_bound": true,
  "use_short_conv": false,
  "vocab_size": 32000
}
